
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_id.id: Refreshing state... [id=ZP7UUg]
google_project.project: Refreshing state... [id=projects/discord-bots64fed452]
google_project_service.service["containerregistry.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/containerregistry.googleapis.com]
google_project_service.service["firestore.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/firestore.googleapis.com]
google_project_service.service["secretmanager.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/secretmanager.googleapis.com]
google_project_service.service["compute.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/compute.googleapis.com]
google_project_service.service["cloudbuild.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/cloudbuild.googleapis.com]
google_project_service.service["serviceusage.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/serviceusage.googleapis.com]
google_project_service.service["firebase.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/firebase.googleapis.com]
google_project_iam_member.joshua_thompsonja_roles["roles/viewer"]: Refreshing state... [id=discord-bots64fed452/roles/viewer/user:joshua@thompsonja.com]
google_project_service.service["cloudbilling.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/cloudbilling.googleapis.com]
google_project_service.service["run.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/run.googleapis.com]
google_project_service.service["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/cloudresourcemanager.googleapis.com]
google_project_service.service["artifactregistry.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/artifactregistry.googleapis.com]
google_project_service.service["iam.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/iam.googleapis.com]
time_sleep.artifact_registry_api_enabling: Refreshing state... [id=2023-04-01T19:52:56Z]
google_artifact_registry_repository.artifact-repo: Refreshing state... [id=projects/discord-bots64fed452/locations/us-east1/repositories/services]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_monitoring_notification_channel.email-owner will be created
  + resource "google_monitoring_notification_channel" "email-owner" {
      + display_name        = "Email Me"
      + enabled             = true
      + force_delete        = false
      + id                  = (known after apply)
      + labels              = {
          + "email_address" = "joshua@thompsonja.com"
        }
      + name                = (known after apply)
      + project             = "discord-bots64fed452"
      + type                = "email"
      + verification_status = (known after apply)
    }

  # google_project_iam_member.cloudbuild_roles["roles/cloudbuild.builds.builder"] will be created
  + resource "google_project_iam_member" "cloudbuild_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:941092486297@cloudbuild.gserviceaccount.com"
      + project = "discord-bots64fed452"
      + role    = "roles/cloudbuild.builds.builder"
    }

  # google_project_iam_member.cloudbuild_roles["roles/run.admin"] will be created
  + resource "google_project_iam_member" "cloudbuild_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:941092486297@cloudbuild.gserviceaccount.com"
      + project = "discord-bots64fed452"
      + role    = "roles/run.admin"
    }

  # google_project_iam_member.compute_roles["roles/run.admin"] will be created
  + resource "google_project_iam_member" "compute_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:941092486297-compute@developer.gserviceaccount.com"
      + project = "discord-bots64fed452"
      + role    = "roles/run.admin"
    }

  # google_project_iam_member.gcp_sa_roles["roles/cloudbuild.serviceAgent"] will be created
  + resource "google_project_iam_member" "gcp_sa_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-941092486297@gcp-sa-cloudbuild.iam.gserviceaccount.com"
      + project = "discord-bots64fed452"
      + role    = "roles/cloudbuild.serviceAgent"
    }

  # google_project_iam_member.serverless_robot_prod_roles["roles/artifactregistry.reader"] will be created
  + resource "google_project_iam_member" "serverless_robot_prod_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-941092486297@serverless-robot-prod.iam.gserviceaccount.com"
      + project = "discord-bots64fed452"
      + role    = "roles/artifactregistry.reader"
    }

  # google_project_iam_member.serverless_robot_prod_roles["roles/run.serviceAgent"] will be created
  + resource "google_project_iam_member" "serverless_robot_prod_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-941092486297@serverless-robot-prod.iam.gserviceaccount.com"
      + project = "discord-bots64fed452"
      + role    = "roles/run.serviceAgent"
    }

  # google_secret_manager_secret.github-key will be created
  + resource "google_secret_manager_secret" "github-key" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = "discord-bots64fed452"
      + secret_id   = "github-private-repo-key"

      + replication {
          + user_managed {
              + replicas {
                  + location = "us-east1"
                }
            }
        }
    }

  # google_secret_manager_secret_iam_binding.github-access will be created
  + resource "google_secret_manager_secret_iam_binding" "github-access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + members   = [
          + "serviceAccount:941092486297@cloudbuild.gserviceaccount.com",
        ]
      + project   = "discord-bots64fed452"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "github-private-repo-key"
    }

  # google_service_account_iam_binding.admin-account-iam will be created
  + resource "google_service_account_iam_binding" "admin-account-iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:941092486297@cloudbuild.gserviceaccount.com",
        ]
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = "projects/discord-bots64fed452/serviceAccounts/941092486297-compute@developer.gserviceaccount.com"
    }

  # google_service_account_iam_binding.run-service-agent will be created
  + resource "google_service_account_iam_binding" "run-service-agent" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:service-941092486297@serverless-robot-prod.iam.gserviceaccount.com",
        ]
      + role               = "roles/run.serviceAgent"
      + service_account_id = "projects/discord-bots64fed452/serviceAccounts/941092486297-compute@developer.gserviceaccount.com"
    }

  # google_storage_bucket.cloud-build-bucket will be created
  + resource "google_storage_bucket" "cloud-build-bucket" {
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = "discord-bots64fed452_cloudbuild"
      + project                     = "discord-bots64fed452"
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>